Infineon/mbedtls-optiga-trust-m/example_tls_client_xmc/xmc4800_iot_kit/common/aws_tcp_echo_client_single_task.c
/*
 * PEM-encoded server certificate
 *
 * Must include the PEM header and footer:
 * "-----BEGIN CERTIFICATE-----\n"\
 * "...base64 data...\n"\
 * "-----END CERTIFICATE-----\n"
 */
#if ( configTCP_ECHO_TASKS_SINGLE_TASK_TLS_ENABLED == 1 )


static const char cTlsECHO_SERVER_CERTIFICATE_PEM[] =
"-----BEGIN CERTIFICATE-----\n"
"MIICbzCCAdgCEQCIiIiIiIiIiIiIiIiIiIiIMA0GCSqGSIb3DQEBCwUAMHgxCzAJ\n"
"BgNVBAYTAlNHMRIwEAYDVQQIDAlCYW5nYWxvcmUxEjAQBgNVBAcMCUJhbmdhbG9y\n"
"ZTEeMBwGA1UECgwVSW5maW5lb24gVGVjaG5vbG9naWVzMQwwCgYDVQQLDANEU1Mx\n"
"EzARBgNVBAMMClRMU19TZXJ2ZXIwHhcNMTkwOTMwMTA1NjE3WhcNMjkwOTI3MTA1\n"
"NjE3WjB4MQswCQYDVQQGEwJTRzESMBAGA1UECAwJQmFuZ2Fsb3JlMRIwEAYDVQQH\n"
"DAlCYW5nYWxvcmUxHjAcBgNVBAoMFUluZmluZW9uIFRlY2hub2xvZ2llczEMMAoG\n"
"A1UECwwDRFNTMRMwEQYDVQQDDApUTFNfU2VydmVyMIGfMA0GCSqGSIb3DQEBAQUA\n"
"A4GNADCBiQKBgQChaEfsQ6u0K9H3VIK1VexdB6nfhDCGRh0QaUnmSTFtJtk+05PT\n"
"8UZ3iHQwqCxAM7HpfFrct1EUlhQEgmzFif6iptjru2GO6fWlfQl/L33xiKgYBpCT\n"
"2v2r7ZEKnz20AnbUE4FjseHiIr9kZ05UiWkYc0te2dc7uKiA2ICqL8ipWwIDAQAB\n"
"MA0GCSqGSIb3DQEBCwUAA4GBACIFn5zFtCR9LUMo/smIbNSDrOV4zUzMpp1p3xFu\n"
"Nkjq8WpJKJDVoIWRVU/J1Ll9dubc4+LB2EtETx+ibBXHdnRPGJqzGWkyFQ9RBOSO\n"
"YV/juDh5qbIdkrInxYv9JZFULryHvOz9DcxB+AuLHVzUhikK2Kfr93SawEs++HdU\n"
"6Xr/\n"
"-----END CERTIFICATE-----\n";

    static const uint32_t ulTlsECHO_SERVER_CERTIFICATE_LENGTH = sizeof( cTlsECHO_SERVER_CERTIFICATE_PEM );
#endif

/*-----------------------------------------------------------*/

/*
 * Uses a socket to send data to, then receive data from, the standard echo
 * port number 7.
 */
static void prvEchoClientTask( void * pvParameters );

/*
 * Creates a pseudo random sized buffer of data to send to the echo server.
 */
static BaseType_t prvCreateTxData( char * ucBuffer,
                                   uint32_t ulBufferLength );

/*-----------------------------------------------------------*/

/* Rx and Tx time outs are used to ensure the sockets do not wait too long for
 * missing data. */
static const TickType_t xReceiveTimeOut = pdMS_TO_TICKS( 2000 );
static const TickType_t xSendTimeOut = pdMS_TO_TICKS( 2000 );

/* Counters for each created task - for inspection only. */
static uint32_t ulTxRxCycles[ echoNUM_ECHO_CLIENTS ] = { 0 },
                ulTxRxFailures[ echoNUM_ECHO_CLIENTS ] = { 0 },
                ulConnections[ echoNUM_ECHO_CLIENTS ] = { 0 };

/* Rx and Tx buffers for each created task. */
static char cTxBuffers[ echoNUM_ECHO_CLIENTS ][ echoBUFFER_SIZES ],
            cRxBuffers[ echoNUM_ECHO_CLIENTS ][ echoBUFFER_SIZES ];

/*-----------------------------------------------------------*/

void vStartTCPEchoClientTasks_SingleTasks( void )
{
    BaseType_t xX;
    char cNameBuffer[ echoMAX_TASK_NAME_LENGTH ];

    /* Create the echo client tasks. */
    for( xX = 0; xX < echoNUM_ECHO_CLIENTS; xX++ )
    {
        snprintf( cNameBuffer, echoMAX_TASK_NAME_LENGTH, "Echo%ld", xX );
        xTaskCreate( prvEchoClientTask,                               /* The function that implements the task. */
                     cNameBuffer,                                     /* Just a text name for the task to aid debugging. */
                     democonfigTCP_ECHO_TASKS_SINGLE_TASK_STACK_SIZE, /* The stack size is defined in FreeRTOSIPConfig.h. */
                     ( void * ) xX,                                   /* The task parameter, not used in this case. */
                     //democonfigTCP_ECHO_TASKS_SINGLE_TASK_PRIORITY,   /* The priority assigned to the task is defined in FreeRTOSConfig.h. */
					 tskIDLE_PRIORITY,
                     NULL );                                          /* The task handle is not used. */
    }
}
/*-----------------------------------------------------------*/

//Test define macros
#define ENABLE_TRUSTM           1

#define READ_UID_TEST           0
int TRUSTM_UID_LOOP_COUNT =1;

#define AUTH_TEST               0
int TRUSTM_AUTH_LOOP_COUNT=1;

#define EXAMPLE_UNIT_TESTS      0
int TRUSTM_UNIT_TEST_LOOP_COUNT=1;

#define TRUSTM_RSA_TEST         0

static void prvEchoClientTask( void * pvParameters )
{
    Socket_t xSocket;
/*_RB_ struct convention is for this not to be typedef'ed, so 'struct' is required. */ SocketsSockaddr_t xEchoServerAddress;
    int32_t lLoopCount = 0UL;
    const int32_t lMaxLoopCount = 100;
    volatile uint32_t ulTxCount = 0UL;
    BaseType_t xReceivedBytes, xReturned, xInstance;
    BaseType_t xTransmitted, xStringLength;
    char * pcTransmittedString;
    char * pcReceivedString;
    TickType_t xTimeOnEntering;
    const int CONNECT_COUNT = 1;

#if (SHOW_ECHO_TASK_PATH == 1)
	configPRINTF( ( ">prvEchoClientTask()\r\n") );
#endif

    #if ( ipconfigUSE_TCP_WIN == 1 )
        {
            WinProperties_t xWinProps;

            /* Fill in the buffer and window sizes that will be used by the socket. */
            xWinProps.lTxBufSize = ipconfigTCP_TX_BUFFER_LENGTH;
            xWinProps.lTxWinSize = configECHO_CLIENT_TX_WINDOW_SIZE;
            xWinProps.lRxBufSize = ipconfigTCP_RX_BUFFER_LENGTH;
            xWinProps.lRxWinSize = configECHO_CLIENT_RX_WINDOW_SIZE;
        }
    #endif /* ipconfigUSE_TCP_WIN */

    /* This task can be created a number of times.  Each instance is numbered
     * to enable each instance to use a different Rx and Tx buffer.  The number is
     * passed in as the task's parameter. */
    xInstance = ( BaseType_t ) pvParameters;

    /* Point to the buffers to be used by this instance of this task. */
    pcTransmittedString = &( cTxBuffers[ xInstance ][ 0 ] );
    pcReceivedString = &( cRxBuffers[ xInstance ][ 0 ] );

#if defined(TLS_SECRET_IN_TRUSTM)
#if ( ENABLE_TRUSTM == 1 )
	optiga_lib_status_t open_app_status = trustm_OpenApp();
	if (open_app_status != OPTIGA_LIB_SUCCESS)
	{
		configPRINTF( ( "TCPCLient(): Error: Open TrustM App failed. status=0x%x\r\n",open_app_status) );
		goto cleanup;
	}else
	{
		configPRINTF( ( "TCPCLient(): Open TrustM App Ok\r\n") );
	}
	configPRINTF( ( "TCPCLient(): Pairing of host and OPTIGA \r\n") );
	//example_pair_host_and_optiga_using_pre_shared_secret();

