Infineon/mbedtls-optiga-trust-m/example_tls_client_xmc/xmc4800_iot_kit/common/aws_tcp_echo_client_single_task.c
#if ( READ_UID_TEST == 1 )
	do{
		configPRINTF( ( "+++++Read UID Test:+++++\r\n") );
		example_optiga_util_read_uid();
		configPRINTF( ( "Read UID done count=%d\r\n",TRUSTM_UID_LOOP_COUNT-- ) );
	}while(TRUSTM_UID_LOOP_COUNT);
	configPRINTF( ( "+++++Read UID Test Completed+++++\r\n") );
#endif

#if ( AUTH_TEST == 1 )
	do{
		configPRINTF( ( "+++++Authentication Test+++++\r\n") );
		example_authenticate_chip();
		configPRINTF( ( "Auth done count=%d\r\n",TRUSTM_AUTH_LOOP_COUNT-- ) );
	}while(TRUSTM_AUTH_LOOP_COUNT);
	configPRINTF( ( "+++++Auth Test Completed+++++\r\n") );
#endif

#if (EXAMPLE_UNIT_TESTS==1)
	    do
	    {
	    	configPRINTF( ( "+++++Unit Tests+++++\r\n") );
			example_optiga_crypt_ecc_generate_keypair();
			example_optiga_crypt_ecdsa_sign();
			example_optiga_crypt_ecdsa_verify();
			example_optiga_crypt_hash();
			example_optiga_crypt_random();

			example_optiga_crypt_rsa_encrypt_message();

			example_optiga_crypt_rsa_generate_keypair();
			example_optiga_crypt_rsa_sign();
			example_optiga_crypt_rsa_verify();
			example_optiga_util_protected_update();
			example_optiga_util_read_data();
			example_optiga_util_update_count();
			example_optiga_util_write_data();
			example_optiga_crypt_tls_prf_sha256();
			example_optiga_crypt_ecdh();
			example_optiga_crypt_rsa_encrypt_session();
			example_optiga_crypt_rsa_decrypt_and_export();

			configPRINTF( ( "Example unit tests loop count=%d\r\n",TRUSTM_UNIT_TEST_LOOP_COUNT--) );
	    }while(TRUSTM_UNIT_TEST_LOOP_COUNT);
	    configPRINTF( ( "+++++Unit Tests Completed+++++\r\n") );
#endif

#if (TRUSTM_RSA_TEST == 1)
	do{
		configPRINTF( ( "+++++TrustM pre shared secret Test+++++\r\n") );
	    example_pair_host_and_optiga_using_pre_shared_secret();
		configPRINTF( ( "+++++TrustM pre shared secret Test Completed+++++\r\n") );

		configPRINTF( ( "+++++TrustM RSA Verify Test+++++\r\n") );
		example_mbedtls_optiga_crypt_rsa_verify();
		configPRINTF( ( "+++++TrustM RSA Verify Test Completed+++++\r\n") );

		configPRINTF( ( "+++++TrustM RSA Sign Test+++++\r\n") );
		example_mbedtls_optiga_crypt_rsa_sign();
		configPRINTF( ( "+++++TrustM RSA Sign Test Completed+++++\r\n") );

		configPRINTF( ( "+++++TrustM RSA Encrypt Test+++++\r\n") );
		example_mbedtls_optiga_crypt_rsa_encrypt();
		configPRINTF( ( "+++++TrustM RSA Encrypt Test Completed+++++\r\n") );

		configPRINTF( ( "+++++TrustM RSA Decrypt Test+++++\r\n") );
		example_mbedtls_optiga_crypt_rsa_decrypt();
		configPRINTF( ( "+++++TrustM RSA Decrypt Test Completed+++++\r\n") );
	} while(FALSE);

#endif
#endif
#endif


    /* Echo requests are sent to the echo server.  The address of the echo
     * server is configured by the constants configECHO_SERVER_ADDR0 to
     * configECHO_SERVER_ADDR3 in FreeRTOSConfig.h. */
    xEchoServerAddress.usPort = SOCKETS_htons( echoECHO_PORT );
    xEchoServerAddress.ulAddress = SOCKETS_inet_addr_quick( configECHO_SERVER_ADDR0,
                                                            configECHO_SERVER_ADDR1,
                                                            configECHO_SERVER_ADDR2,
                                                            configECHO_SERVER_ADDR3 );


    for( int i=0; i<CONNECT_COUNT;i++ )
    {
    	 configPRINTF( ( "================= TCP Client Connect count=%d ===================\r\n", i ) );

        /* Create a TCP socket. */
        xSocket = SOCKETS_Socket( SOCKETS_AF_INET, SOCKETS_SOCK_STREAM, SOCKETS_IPPROTO_TCP );
        configASSERT( xSocket != SOCKETS_INVALID_SOCKET );

        /* Set a time out so a missing reply does not cause the task to block
         * indefinitely. */
        SOCKETS_SetSockOpt( xSocket, 0, SOCKETS_SO_RCVTIMEO, &xReceiveTimeOut, sizeof( xReceiveTimeOut ) );
        SOCKETS_SetSockOpt( xSocket, 0, SOCKETS_SO_SNDTIMEO, &xSendTimeOut, sizeof( xSendTimeOut ) );

        #if ( ipconfigUSE_TCP_WIN == 1 )
            {
                /* Set the window and buffer sizes. */
                SOCKETS_SetSockOpt( xSocket, 0, FREERTOS_SO_WIN_PROPERTIES, ( void * ) &xWinProps, sizeof( xWinProps ) );
            }
        #endif /* ipconfigUSE_TCP_WIN */

        #if ( configTCP_ECHO_TASKS_SINGLE_TASK_TLS_ENABLED == 1 )
            {
                /* Set the socket to use TLS. */
                SOCKETS_SetSockOpt( xSocket, 0, SOCKETS_SO_REQUIRE_TLS, NULL, ( size_t ) 0 );
                SOCKETS_SetSockOpt( xSocket, 0, SOCKETS_SO_TRUSTED_SERVER_CERTIFICATE, cTlsECHO_SERVER_CERTIFICATE_PEM, ulTlsECHO_SERVER_CERTIFICATE_LENGTH );
            }
        #endif /* configTCP_ECHO_TASKS_SINGLE_TASK_TLS_ENABLED */

        /* Connect to the echo server. */
        configPRINTF( ( "Connecting to echo server port=%d\r\n", echoECHO_PORT ) );

        if( SOCKETS_Connect( xSocket, &xEchoServerAddress, sizeof( xEchoServerAddress ) ) == 0 )
        {
            configPRINTF( ( "Connected to echo server (IP=%d.%d.%d.%d)\r\n",configECHO_SERVER_ADDR0, configECHO_SERVER_ADDR1, configECHO_SERVER_ADDR2, configECHO_SERVER_ADDR3 ) );
            ulConnections[ xInstance ]++;

            /* Send a number of echo requests. */
            for( lLoopCount = 0; lLoopCount < lMaxLoopCount; lLoopCount++ )
            {
                /* Create the string that is sent to the echo server. */
                xStringLength = prvCreateTxData( pcTransmittedString, echoBUFFER_SIZES );

                /* Add in some unique text at the front of the string. */
                sprintf( pcTransmittedString, "TxRx message number %u", ( unsigned ) ulTxCount );
                ulTxCount++;

                /* Send the string to the socket. */
                xTransmitted = SOCKETS_Send( xSocket,                        /* The socket being sent to. */
                                             ( void * ) pcTransmittedString, /* The data being sent. */
                                             xStringLength,                  /* The length of the data being sent. */
                                             0 );                            /* No flags. */

                configPRINTF( ( "Sending %s of length %d to echo server\r\n", pcTransmittedString, xStringLength ) );

                if( xTransmitted < 0 )
                {
                    /* Error? */
                    configPRINTF( ( "ERROR - Failed to send to echo server\r\n", pcTransmittedString ) );
                    break;
                }

                /* Clear the buffer into which the echoed string will be
                 * placed. */
                memset( ( void * ) pcReceivedString, 0x00, echoBUFFER_SIZES );
                xReceivedBytes = 0;

                /* Receive data echoed back to the socket. */
                while( xReceivedBytes < xTransmitted )
                {
                    xReturned = SOCKETS_Recv( xSocket,                                 /* The socket being received from. */
                                              &( pcReceivedString[ xReceivedBytes ] ), /* The buffer into which the received data will be written. */
                                              xStringLength - xReceivedBytes,          /* The size of the buffer provided to receive the data. */
                                              0 );                                     /* No flags. */

                    if( xReturned < 0 )
                    {
                        /* Error occurred.  Latch it so it can be detected
                         * below. */
                        xReceivedBytes = xReturned;
                        break;
                    }
                    else if( xReturned == 0 )
                    {
                        /* Timed out. */
                        configPRINTF( ( "Timed out receiving from echo server\r\n" ) );
                        break;
                    }
                    else
                    {
                        /* Keep a count of the bytes received so far. */
                        xReceivedBytes += xReturned;
                    }
                }

                /* If an error occurred it will be latched in xReceivedBytes,
                 * otherwise xReceived bytes will be just that - the number of
                 * bytes received from the echo server. */
                if( xReceivedBytes > 0 )
                {
                    /* Compare the transmitted string to the received string. */
                    configASSERT( strncmp( pcReceivedString, pcTransmittedString, xTransmitted ) == 0 );

                    if( strncmp( pcReceivedString, pcTransmittedString, xTransmitted ) == 0 )
                    {
                        /* The echo reply was received without error. */
                        ulTxRxCycles[ xInstance ]++;
                        configPRINTF( ( "Received correct string from echo server.\r\n" ) );
                    }
                    else
                    {
                        /* The received string did not match the transmitted
                         * string. */
                        ulTxRxFailures[ xInstance ]++;
                        configPRINTF( ( "ERROR - Received incorrect string from echo server.\r\n" ) );
                        break;
                    }
                }
                else if( xReceivedBytes < 0 )
                {
                    /* SOCKETS_Recv() returned an error. */
                    break;
                }
                else
                {
                    /* Timed out without receiving anything? */
                    break;
                }
            }

